_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 228, 228, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 226, 226, 128)     3584      
_________________________________________________________________
batch_normalization_1 (Batch (None, 226, 226, 128)     512       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 113, 113, 128)     0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 115, 115, 128)     0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 113, 113, 64)      73792     
_________________________________________________________________
batch_normalization_2 (Batch (None, 113, 113, 64)      256       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 56, 64)        0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 58, 58, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 56, 56, 32)        18464     
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 56, 32)        128       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 28, 32)        0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 30, 30, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 16)        4624      
_________________________________________________________________
batch_normalization_4 (Batch (None, 28, 28, 16)        64        
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 14, 16)        0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 14, 14, 8)         1160      
_________________________________________________________________
batch_normalization_5 (Batch (None, 14, 14, 8)         32        
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 16, 16, 8)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 14, 14, 8)         584       
_________________________________________________________________
batch_normalization_6 (Batch (None, 14, 14, 8)         32        
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 28, 28, 8)         0         
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 30, 30, 8)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 16)        1168      
_________________________________________________________________
batch_normalization_7 (Batch (None, 28, 28, 16)        64        
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 56, 56, 16)        0         
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 58, 58, 16)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 56, 56, 32)        4640      
_________________________________________________________________
batch_normalization_8 (Batch (None, 56, 56, 32)        128       
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 112, 112, 32)      0         
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 114, 114, 32)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 112, 112, 64)      18496     
_________________________________________________________________
batch_normalization_9 (Batch (None, 112, 112, 64)      256       
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 224, 224, 64)      0         
_________________________________________________________________
zero_padding2d_10 (ZeroPaddi (None, 228, 228, 64)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 226, 226, 128)     73856     
_________________________________________________________________
batch_normalization_10 (Batc (None, 226, 226, 128)     512       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 226, 226, 4)       516       
_________________________________________________________________
activation_1 (Activation)    (None, 226, 226, 4)       0         
=================================================================
Total params: 202,868
Trainable params: 201,876
Non-trainable params: 992
_________________________________________________________________
