_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 228, 228, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 226, 226, 64)      1792      
_________________________________________________________________
batch_normalization_1 (Batch (None, 226, 226, 64)      256       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 113, 113, 64)      0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 115, 115, 64)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 113, 113, 128)     73856     
_________________________________________________________________
batch_normalization_2 (Batch (None, 113, 113, 128)     512       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 56, 128)       0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 58, 58, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 56, 56, 256)       295168    
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 58, 58, 256)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
batch_normalization_4 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 112, 112, 256)     0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 114, 114, 256)     0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 112, 112, 128)     295040    
_________________________________________________________________
batch_normalization_5 (Batch (None, 112, 112, 128)     512       
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 224, 224, 128)     0         
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 228, 228, 128)     0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 226, 226, 64)      73792     
_________________________________________________________________
batch_normalization_6 (Batch (None, 226, 226, 64)      256       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 226, 226, 4)       260       
_________________________________________________________________
activation_1 (Activation)    (None, 226, 226, 4)       0         
=================================================================
Total params: 1,333,572
Trainable params: 1,331,780
Non-trainable params: 1,792
_________________________________________________________________
