_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 228, 228, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 226, 226, 32)      896       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 113, 113, 32)      0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 115, 115, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 113, 113, 64)      18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 56, 64)        0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 58, 58, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 56, 56, 128)       73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 28, 128)       0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 30, 30, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 256)       295168    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 14, 256)       0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 14, 14, 512)       1180160   
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 14, 14, 512)       2359808   
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 28, 28, 512)       0         
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 30, 30, 512)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 256)       1179904   
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 56, 56, 256)       0         
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 58, 58, 256)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 56, 56, 128)       295040    
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 112, 112, 128)     0         
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 114, 114, 128)     0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 112, 112, 64)      73792     
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 224, 224, 64)      0         
_________________________________________________________________
zero_padding2d_10 (ZeroPaddi (None, 228, 228, 64)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 226, 226, 32)      18464     
_________________________________________________________________
batch_normalization_1 (Batch (None, 226, 226, 32)      128       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 226, 226, 4)       132       
_________________________________________________________________
activation_1 (Activation)    (None, 226, 226, 4)       0         
=================================================================
Total params: 5,495,844
Trainable params: 5,495,780
Non-trainable params: 64
_________________________________________________________________
