_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 228, 228, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 226, 226, 16)      448       
_________________________________________________________________
batch_normalization_1 (Batch (None, 226, 226, 16)      64        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 113, 113, 16)      0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 115, 115, 16)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 113, 113, 32)      4640      
_________________________________________________________________
batch_normalization_2 (Batch (None, 113, 113, 32)      128       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 56, 32)        0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 58, 58, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 56, 56, 64)        18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 56, 64)        256       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 28, 64)        0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 30, 30, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 128)       73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 28, 28, 128)       512       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 14, 128)       0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 14, 14, 256)       295168    
_________________________________________________________________
batch_normalization_5 (Batch (None, 14, 14, 256)       1024      
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 14, 14, 256)       590080    
_________________________________________________________________
batch_normalization_6 (Batch (None, 14, 14, 256)       1024      
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 28, 28, 256)       0         
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 30, 30, 256)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 128)       295040    
_________________________________________________________________
batch_normalization_7 (Batch (None, 28, 28, 128)       512       
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 56, 56, 128)       0         
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 58, 58, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 56, 56, 64)        73792     
_________________________________________________________________
batch_normalization_8 (Batch (None, 56, 56, 64)        256       
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 112, 112, 64)      0         
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 114, 114, 64)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 112, 112, 32)      18464     
_________________________________________________________________
batch_normalization_9 (Batch (None, 112, 112, 32)      128       
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 224, 224, 32)      0         
_________________________________________________________________
zero_padding2d_10 (ZeroPaddi (None, 228, 228, 32)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 226, 226, 16)      4624      
_________________________________________________________________
batch_normalization_10 (Batc (None, 226, 226, 16)      64        
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 226, 226, 4)       68        
_________________________________________________________________
activation_1 (Activation)    (None, 226, 226, 4)       0         
=================================================================
Total params: 1,378,644
Trainable params: 1,376,660
Non-trainable params: 1,984
_________________________________________________________________
