_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 228, 228, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 226, 226, 64)      1792      
_________________________________________________________________
batch_normalization_1 (Batch (None, 226, 226, 64)      256       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 113, 113, 64)      0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 115, 115, 64)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 113, 113, 80)      46160     
_________________________________________________________________
batch_normalization_2 (Batch (None, 113, 113, 80)      320       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 56, 80)        0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 58, 58, 80)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 56, 56, 96)        69216     
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 56, 96)        384       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 28, 96)        0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 30, 30, 96)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 128)       110720    
_________________________________________________________________
batch_normalization_4 (Batch (None, 28, 28, 128)       512       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 14, 128)       0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 14, 14, 194)       223682    
_________________________________________________________________
batch_normalization_5 (Batch (None, 14, 14, 194)       776       
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 16, 16, 194)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 14, 14, 194)       338918    
_________________________________________________________________
batch_normalization_6 (Batch (None, 14, 14, 194)       776       
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 28, 28, 194)       0         
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 30, 30, 194)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 128)       223616    
_________________________________________________________________
batch_normalization_7 (Batch (None, 28, 28, 128)       512       
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 56, 56, 128)       0         
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 58, 58, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 56, 56, 96)        110688    
_________________________________________________________________
batch_normalization_8 (Batch (None, 56, 56, 96)        384       
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 112, 112, 96)      0         
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 114, 114, 96)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 112, 112, 80)      69200     
_________________________________________________________________
batch_normalization_9 (Batch (None, 112, 112, 80)      320       
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 224, 224, 80)      0         
_________________________________________________________________
zero_padding2d_10 (ZeroPaddi (None, 228, 228, 80)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 226, 226, 64)      46144     
_________________________________________________________________
batch_normalization_10 (Batc (None, 226, 226, 64)      256       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 226, 226, 4)       260       
_________________________________________________________________
activation_1 (Activation)    (None, 226, 226, 4)       0         
=================================================================
Total params: 1,244,892
Trainable params: 1,242,644
Non-trainable params: 2,248
_________________________________________________________________
