_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 228, 228, 3)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 226, 226, 64)      1792
_________________________________________________________________
batch_normalization_1 (Batch (None, 226, 226, 64)      256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 113, 113, 64)      0
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 115, 115, 64)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 113, 113, 128)     73856
_________________________________________________________________
batch_normalization_2 (Batch (None, 113, 113, 128)     512
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 56, 128)       0
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 58, 58, 128)       0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 56, 56, 256)       295168
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 56, 256)       1024
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 28, 256)       0
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 30, 30, 256)       0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 512)       1180160
_________________________________________________________________
batch_normalization_4 (Batch (None, 28, 28, 512)       2048
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 30, 30, 512)       0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 28, 28, 512)       2359808
_________________________________________________________________
batch_normalization_5 (Batch (None, 28, 28, 512)       2048
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 56, 56, 512)       0
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 58, 58, 512)       0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 56, 56, 256)       1179904
_________________________________________________________________
batch_normalization_6 (Batch (None, 56, 56, 256)       1024
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 112, 112, 256)     0
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 114, 114, 256)     0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 112, 112, 128)     295040
_________________________________________________________________
batch_normalization_7 (Batch (None, 112, 112, 128)     512
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 224, 224, 128)     0
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 228, 228, 128)     0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 226, 226, 64)      73792
_________________________________________________________________
batch_normalization_8 (Batch (None, 226, 226, 64)      256
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 226, 226, 3)       195
_________________________________________________________________
activation_1 (Activation)    (None, 226, 226, 3)       0
=================================================================
Total params: 5,467,395
Trainable params: 5,463,555
Non-trainable params: 3,840
_________________________________________________________________